Revit 2027 API
Application.OpenDocumentFile Method
Overload List
Name | Description
OpenDocumentFile(String) |  Opens a document from disk.
OpenDocumentFile(ModelPath, OpenOptions) |  Opens a document from disk or cloud.
OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) |  Opens a document from disk or cloud.
Top
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace